In [1]:
import pandas as pd
import numpy as np

In [5]:
series = [1,5,78,7324]
myseries = pd.Series(series)
myseries

0       1
1       5
2      78
3    7324
dtype: int64

In [8]:
print(type(myseries)) 
print(myseries[0])

<class 'pandas.core.series.Series'>
1

In [15]:
myvar1 = pd.Series(series, index = ["x", "y", "z","u"])
print(myvar1)
print(myvar1.index)
for e in myvar1.index:
    print(e)

x       1
y       5
z      78
u    7324
dtype: int64
Index(['x', 'y', 'z', 'u'], dtype='object')
x
y
z
u
1

1

In [16]:
print(myvar1.x,"\n")
print(myvar1["x"])

1

1

In [20]:
calories = {"day1": 420, "day2": 380, "day3": 390}
myvar2 = pd.Series(calories)
myvar2

day1    420
day2    380
day3    390
dtype: int64

In [22]:
myvar3 = pd.Series(calories, index = ["day1", "day2"])
myvar3

day1    420
day2    380
dtype: int64

In [25]:
data = {
    'name': ['Jason', 'Molly', 'Tina', 'Jake', 'Amy'], 
    'year': [2012, 2012, 2013, 2014, 2014], 
    'reports': [4, 24, 31, 2, 3]
}
df2=pd.DataFrame(data)
df2

    name  year  reports
0  Jason  2012        4
1  Molly  2012       24
2   Tina  2013       31
3   Jake  2014        2
4    Amy  2014        3

In [27]:
df3 = pd.DataFrame(data, index = ['Cochice', 'Pima', 'Santa Cruz', 'Maricopa', 'Yuma'])    
df3

             name  year  reports
Cochice     Jason  2012        4
Pima        Molly  2012       24
Santa Cruz   Tina  2013       31
Maricopa     Jake  2014        2
Yuma          Amy  2014        3

In [29]:
df3=df3.drop(df3.index[2])
df3

          name  year  reports
Cochice  Jason  2012        4
Pima     Molly  2012       24
Yuma       Amy  2014        3

In [31]:
df4=df3.drop(['Cochice','Pima'])
df4

     name  year  reports
Yuma  Amy  2014        3

In [32]:
df5=df3.drop('reports', axis=1)
df5

          name  year
Cochice  Jason  2012
Pima     Molly  2012
Yuma       Amy  2014

In [33]:
df6=df3[df3.name != 'Molly']
df6

          name  year  reports
Cochice  Jason  2012        4
Yuma       Amy  2014        3

In [34]:
df7=df3.drop(df3.index[[1,2]])
df7

          name  year  reports
Cochice  Jason  2012        4